-- MySQL dump 10.13  Distrib 8.0.42, for Win64 (x86_64)
--
-- Host: localhost    Database: bangumi
-- ------------------------------------------------------
-- Server version	8.0.42

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `bangumi_info`
--

DROP TABLE IF EXISTS `bangumi_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `bangumi_info` (
  `id` int NOT NULL AUTO_INCREMENT,
  `banguminame` varchar(40) NOT NULL,
  `start_time` varchar(10) NOT NULL,
  `screening` varchar(10) DEFAULT NULL,
  `platform` varchar(10) DEFAULT NULL,
  `isfinish` tinyint(1) NOT NULL,
  `episodes` int NOT NULL,
  `season` varchar(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=67 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bangumi_info`
--

LOCK TABLES `bangumi_info` WRITE;
/*!40000 ALTER TABLE `bangumi_info` DISABLE KEYS */;
INSERT INTO `bangumi_info` VALUES (1,'爱有点沉重的暗黑精灵从异世界紧追不放','4.7','周一00:05','暂无',0,12,'2025.4'),(2,'拉撒路（LAZARUS）','4.7','周一00:15','暂无',0,13,'2025.4'),(3,'快藏好！玛琪娜同学！！','4.7','周一00:20','暂无',0,12,'2025.4'),(4,'转生成猫咪的大叔','连载中','周一13:50','暂无',0,12,'2025.4'),(5,'测不准的阿波连同学 第二季','4.7','周一21:00','bilibili',0,12,'2025.4'),(6,'随兴旅-That\'s Journey-（杂旅）','4.7','周一22:00','暂无',0,12,'2025.4'),(7,'鬼人幻灯抄','3.31','周一23:00','暂无',0,24,'2025.4'),(8,'#COMPASS2.0 战斗天赋解析系统','4.7','周一23:00','暂无',0,12,'2025.4'),(9,'夏日口袋（Summer Pockets）','4.7','周一23:00','bilibili',0,26,'2025.4'),(10,'正义使者 - 我的英雄学院之非法英雄','4.7','周一23:00','暂无',0,13,'2025.4'),(11,'中禅寺老师妖怪讲义录 解谜就交给老师','4.8','周二01:30','暂无',0,12,'2025.4'),(12,'最强王者的第二人生（终末起点）','4.22','周二19:00','bilibili',0,12,'2025.4'),(13,'紫云寺家的兄弟姐妹','4.8','周二21:30','暂无',0,12,'2025.4'),(14,'直至魔女消逝','4.22','周二22:30','bilibili',0,12,'2025.4'),(15,'阳光马达棒球场！','4.1','周二23:00','暂无',0,12,'2025.4'),(16,'机动战士高达 GQuuuuuuX','4.8','周二23:29','暂无',0,12,'2025.4'),(17,'末日后酒店（启示录酒店）','4.9','周三01:40','bilibili',0,12,'2025.4'),(18,'莉可丽丝：友谊是时间的窃贼','4.16','周三20:00','bilibili',0,6,'2025.4'),(19,'拜托请穿上，鹰峰同学','4.2','周三21:30','暂无',0,12,'2025.4'),(20,'华Doll*-Reinterpretation of Flowering-','4.9','周三22:30','暂无',0,12,'2025.4'),(21,'记忆缝线（YOUR FORMA）','4.2','周三23:15','暂无',0,13,'2025.4'),(22,'完美到难以接近的圣女遭到解除婚约后被卖到邻国','4.2','周三23:30','暂无',0,12,'2025.4'),(23,'外星人姆姆','4.10','周四00:00','暂无',0,24,'2025.4'),(24,'最强王者的第二人生（终末起点）（港澳台）','4.3','周四00:45','暂无',0,12,'2025.4'),(25,'MIRU 我们的未来','4.3','周四01:30','暂无',0,5,'2025.4'),(26,'你与我最后的战场 亦或是世界起始的圣战 第二季','5.8','周四19:30','bilibili',0,12,'2025.4'),(27,'忍者与杀手的两人生活','4.10','周四20:30','暂无',0,12,'2025.4'),(28,'天才治疗师退队作为无照治疗师快乐生活','4.3','周四23:00','bilibili',0,12,'2025.4'),(29,'摇滚乃是淑女的爱好','4.3','周四23:56','bilibili',0,13,'2025.4'),(30,'防风少年 第二季（防风铃）','4.4','周五00:56','暂无',0,12,'2025.4'),(31,'宝可梦 地平线','连载中','周五17:55','暂无',0,-1,'2025.4'),(32,'战队大失格 第二季','5.2','周五18:00','bilibili',0,12,'2025.4'),(33,'赛马娘 芦毛灰姑娘','5.2','周五20:00','bilibili',0,13,'2025.4'),(34,'男女之间存在纯友情吗？（不，不存在!）','4.4','周五21:30','暂无',0,12,'2025.4'),(35,'药屋少女的呢喃 第二季','连载中','周五22:00','暂无',0,24,'2025.4'),(36,'推理要在晚餐后','4.4','周五22:30','暂无',0,12,'2025.4'),(37,'再见，地球 第二季','4.4','周五22:30','暂无',0,12,'2025.4'),(38,'神统记','4.11','周五23:30','暂无',0,12,'2025.4'),(39,'每日男公关（Everyday Host）','4.5','周六00:13','暂无',0,0,'2025.4'),(40,'炎炎消防队 第三季（叁之章）','4.5','周六01:23','bilibili',0,12,'2025.4'),(41,'真･武士传 剑勇传说（城市风云儿 / 九龙珠）','4.5','周六16:30','暂无',0,24,'2025.4'),(42,'名侦探柯南','连载中','周六19:30','暂无',0,1253,'2025.4'),(43,'安妮·雪莉','4.5','周六20:55','暂无',0,24,'2025.4'),(44,'打了300年的史莱姆不知不觉就练到了满级 第二季','4.5','周六21:00','暂无',0,12,'2025.4'),(45,'罪恶装备 奋战: 两位裁决者','4.5','周六21:30','暂无',0,12,'2025.4'),(46,'搞笑漫画日和 第五季（GO）','4.5','周六22:00','暂无',0,12,'2025.4'),(47,'九龙大众浪漫','4.5','周六22:30','暂无',0,13,'2025.4'),(48,'乡下大叔成为剑圣','4.19','周六23:00','bilibili',0,12,'2025.4'),(49,'黑执事 绿之魔女篇','4.6','周日00:00','暂无',0,13,'2025.4'),(50,'离开A级队伍的我，和从前的弟子往迷宫深处迈进','连载中','周日00:30','暂无',0,24,'2025.4'),(51,'我与尼特女忍者的莫名同居生活','连载中','周日00:30','暂无',0,24,'2025.4'),(52,'Classic★Stars – 古典乐★之星','4.6','周日00:30','暂无',0,13,'2025.4'),(53,'mono女孩','4.13','周日00:30','暂无',0,13,'2025.4'),(54,'岁月流逝饭菜依旧美味','4.13','周日01:00','暂无',0,12,'2025.4'),(55,'我是星际国家的恶德领主！','3.25','周日01:30','暂无',0,12,'2025.4'),(56,'小市民系列 第二季','4.6','周日02:00','暂无',0,12,'2025.4'),(57,'你与偶像 光之美少女♪','连载中','周日07:30','暂无',0,49,'2025.4'),(58,'公主的管弦乐团','4.6','周日08:00','暂无',0,48,'2025.4'),(59,'秘密的偶像公主 RING篇','连载中','周日09:00','暂无',0,0,'2025.4'),(60,'魔女与使魔（魔女守护者）','4.13','周日16:30','暂无',0,26,'2025.4'),(61,'转生为白猪贵族的我，运用前世记忆养育雏鸟般的弟弟','4.20','周日20:00','暂无',0,12,'2025.4'),(62,'使人误解的工房主（干杂活我乃最强）','3.30','周日22:30','暂无',0,12,'2025.4'),(63,'前桥魔女','4.6','周日22:30','bilibili',0,12,'2025.4'),(64,'受到猩猩之神庇护的大小姐在皇家骑士团受到宠爱','4.6','周日22:30','暂无',0,12,'2025.4'),(65,'航海王（海贼王）','连载中','周日夜晚','爱奇艺',0,-1,'2025.4'),(66,'月出之战','4.10','周四','暂无',0,18,'2025.4');
/*!40000 ALTER TABLE `bangumi_info` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-25 17:44:10
